Revit 2026 API

# WorksharingUtils Properties

---

The WorksharingUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

WorksharingUtils Class

Autodesk.Revit.DB Namespace